#### Terraform Format and Style 🖌`success`

<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

"data.terraform_remote_state.stacks: Reading...
data.terraform_remote_state.stacks_platform: Reading...
data.github_repository_file.argocd: Reading...
data.github_repository_file.argocd_apps: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.cluster_autoscaler_irsa.data.aws_region.current: Reading...
module.cluster_autoscaler_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cert_manager_irsa.data.aws_partition.current: Reading...
module.crossplane_irsa.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.external_secrets_irsa.data.aws_region.current: Reading...
module.external_secrets_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.load_balancer_controller_irsa.data.aws_region.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.load_balancer_controller_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.vpc_cni_irsa.data.aws_caller_identity.current: Reading...
data.github_repository_file.argocd_apps: Read complete after 1s [id=argo/config/argocd-apps-values.yaml]
module.external_secrets_irsa.data.aws_iam_policy_document.external_secrets[0]: Reading...
module.external_secrets_irsa.data.aws_iam_policy_document.external_secrets[0]: Read complete after 0s [id=181387571]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.cert_manager_irsa.data.aws_caller_identity.current: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.crossplane_irsa.data.aws_region.current: Reading...
module.crossplane_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.external_secrets_irsa.data.aws_partition.current: Reading...
module.external_secrets_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.node_termination_handler_irsa.data.aws_caller_identity.current: Reading...
module.crossplane_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.node_termination_handler_irsa.data.aws_partition.current: Reading...
module.node_termination_handler_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.load_balancer_controller_irsa.data.aws_partition.current: Reading...
module.load_balancer_controller_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa.data.aws_region.current: Reading...
module.external_dns_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.external_dns_irsa.data.aws_caller_identity.current: Reading...
module.external_secrets_irsa.data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.load_balancer_controller_irsa.data.aws_caller_identity.current: Reading...
module.vpc_cni_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.vpc_cni_irsa.data.aws_partition.current: Reading...
module.vpc_cni_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.crossplane_irsa.data.aws_partition.current: Reading...
module.crossplane_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.external_dns_irsa.data.aws_partition.current: Reading...
module.external_dns_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc_cni_irsa.data.aws_region.current: Reading...
module.vpc_cni_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.cert_manager_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.external_dns_irsa.data.aws_iam_policy_document.external_dns[0]: Reading...
module.cluster_autoscaler_irsa.data.aws_partition.current: Reading...
module.external_dns_irsa.data.aws_iam_policy_document.external_dns[0]: Read complete after 0s [id=1621011895]
module.cluster_autoscaler_irsa.data.aws_partition.current: Read complete after 0s [id=aws]
module.cluster_autoscaler_irsa.data.aws_caller_identity.current: Reading...
module.cert_manager_irsa.data.aws_region.current: Reading...
module.node_termination_handler_irsa.data.aws_iam_policy_document.node_termination_handler[0]: Reading...
module.node_termination_handler_irsa.data.aws_iam_policy_document.node_termination_handler[0]: Read complete after 0s [id=734748348]
module.cert_manager_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.node_termination_handler_irsa.data.aws_region.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.node_termination_handler_irsa.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.node_termination_handler_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::023093918714:user/terraform-aws]
module.external_dns_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.external_secrets_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc_cni_irsa.data.aws_iam_policy_document.vpc_cni[0]: Reading...
module.load_balancer_controller_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.vpc_cni_irsa.data.aws_iam_policy_document.vpc_cni[0]: Read complete after 0s [id=572553129]
module.load_balancer_controller_irsa.data.aws_iam_policy_document.load_balancer_controller[0]: Reading...
module.load_balancer_controller_irsa.data.aws_iam_policy_document.load_balancer_controller[0]: Read complete after 0s [id=898716815]
module.cluster_autoscaler_irsa.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
data.terraform_remote_state.stacks: Read complete after 1s
module.cert_manager_irsa.data.aws_iam_policy_document.cert_manager[0]: Reading...
data.terraform_remote_state.stacks_platform: Read complete after 1s
module.cert_manager_irsa.data.aws_iam_policy_document.cert_manager[0]: Read complete after 0s [id=1322757125]
module.cluster_autoscaler_irsa.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
data.external.aws_eks_cluster_endpoint: Reading...
data.external.aws_eks_cluster_ca_certificate: Reading...
data.external.aws_eks_cluster_token: Reading...
module.cluster_autoscaler_irsa.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=947437081]
data.github_repository_file.argocd: Read complete after 1s [id=argo/config/argo-cd-values.yaml]
data.external.aws_eks_cluster_token: Read complete after 7s [id=-]
data.external.aws_eks_cluster_endpoint: Read complete after 7s [id=-]
data.external.aws_eks_cluster_ca_certificate: Read complete after 7s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "5.28.1"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # helm_release.argocd_apps will be created
  + resource "helm_release" "argocd_apps" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-apps"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "0.0.9"
      + wait                       = false
      + wait_for_jobs              = false
    }

  # helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.4.8"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "platform-eks-dev"
        }
      + set {
          + name  = "region"
          + value = "us-east-1"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "vpcId"
          + value = jsonencode(
                [
                  + null,
                ]
            )
        }
    }

  # helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.11.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "fullnameOverride"
          + value = "cert-manager"
        }
      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "nameOverride"
          + value = "cert-manager"
        }
      + set {
          + name  = "securityContext.fsGroup"
          + value = "65534"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "cert-manager"
        }
    }

  # helm_release.cluster_autoscaler will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.28.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "platform-eks-dev"
        }
      + set {
          + name  = "awsRegion"
          + value = "us-east-1"
        }
      + set {
          + name  = "fullnameOverride"
          + value = "cluster-autoscaler"
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler"
        }
      + set {
          + name  = "replicaCount"
          + value = "2"
        }
    }

  # helm_release.crossplane will be created
  + resource "helm_release" "crossplane" {
      + atomic                     = false
      + chart                      = "crossplane"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "crossplane"
      + namespace                  = "crossplane-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.crossplane.io/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.12.0"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "args[0]"
          + value = "--enable-environment-configs"
        }
      + set {
          + name  = "serviceAccount.customAnnotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.12.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-secrets"
      + namespace                  = "external-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.8.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
    }

  # helm_release.node_termination_handler will be created
  + resource "helm_release" "node_termination_handler" {
      + atomic                     = false
      + chart                      = "aws-node-termination-handler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = true
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-node-termination-handler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.21.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "awsRegion"
          + value = "us-east-1"
        }
      + set {
          + name  = "fullnameOverride"
          + value = "aws-node-termination-handler"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\.amazonaws\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-node-termination-handler"
        }
    }

  # module.cert_manager_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:cert-manager:cert-manager",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cert_manager_irsa.aws_iam_policy.cert_manager[0] will be created
  + resource "aws_iam_policy" "cert_manager" {
      + arn         = (known after apply)
      + description = "Cert Manager policy to allow management of Route53 hosted zone records"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_Cert_Manager_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:GetChange"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::change/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/[null]"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "route53:ListHostedZonesByName"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.cert_manager_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cert-manager-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cert_manager_irsa.aws_iam_role_policy_attachment.cert_manager[0] will be created
  + resource "aws_iam_role_policy_attachment" "cert_manager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cert-manager-dev"
    }

  # module.cluster_autoscaler_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:cluster-autoscaler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cluster_autoscaler_irsa.aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn         = (known after apply)
      + description = "Cluster autoscaler policy to allow examination and modification of EC2 Auto Scaling Groups"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_Cluster_Autoscaler_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeImages",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/kubernetes.io/cluster/platform-eks-dev" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.cluster_autoscaler_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cluster-autoscaler-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cluster_autoscaler_irsa.aws_iam_role_policy_attachment.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "cluster-autoscaler-dev"
    }

  # module.crossplane_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "Crossplane policy for IRSA on dev environment"
      + id          = (known after apply)
      + name        = "crossplane-dev"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.crossplane_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:crossplane-system:*",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.crossplane_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crossplane-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.crossplane_irsa.aws_iam_role_policy_attachment.this["policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "crossplane-dev"
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/platform-eks-dev/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "App"  = "platform-eks-dev"
          + "Name" = "/aws/eks/platform-eks-dev/cluster"
        }
      + tags_all          = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "/aws/eks/platform-eks-dev/cluster"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["App"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "App"
      + resource_id = (known after apply)
      + value       = "platform-eks-dev"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-eks-dev"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "App" = "platform-eks-dev"
        }
      + tags_all             = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-eks-dev"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "App" = "platform-eks-dev"
        }
      + tags_all             = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "platform-eks-dev"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "App" = "platform-eks-dev"
        }
      + tags_all             = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "platform-eks-dev"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "App" = "platform-eks-dev"
        }
      + tags_all                  = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + version                   = "1.25"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = "10.2.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "null",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "App"  = "platform-eks-dev"
          + "Name" = "platform-eks-dev-eks-irsa"
        }
      + tags_all        = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "platform-eks-dev-eks-irsa"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "platform-eks-dev-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "platform-eks-dev-cluster-"
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "platform-eks-dev-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "platform-eks-dev-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"  = "platform-eks-dev"
          + "Name" = "platform-eks-dev-cluster"
        }
      + tags_all               = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "platform-eks-dev-cluster"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + vpc_id                 = jsonencode(
            [
              + null,
            ]
        )
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "platform-eks-dev-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "App"                                    = "platform-eks-dev"
          + "Name"                                   = "platform-eks-dev-node"
          + "kubernetes.io/cluster/platform-eks-dev" = "owned"
        }
      + tags_all               = {
          + "App"                                    = "platform-eks-dev"
          + "Env"                                    = "dev"
          + "ManagedBy"                              = "Terraform"
          + "Name"                                   = "platform-eks-dev-node"
          + "OrchestratedBy"                         = "Terramate"
          + "Stack"                                  = "platform-k8s"
          + "StackPath"                              = "/stacks/platform/platform-k8s"
          + "kubernetes.io/cluster/platform-eks-dev" = "owned"
        }
      + vpc_id                 = jsonencode(
            [
              + null,
            ]
        )
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "platform-eks-dev"
          + "cluster_version"                    = "1.25"
        }
    }

  # module.external_dns_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:external-dns",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.external_dns_irsa.aws_iam_policy.external_dns[0] will be created
  + resource "aws_iam_policy" "external_dns" {
      + arn         = (known after apply)
      + description = "External DNS policy to allow management of Route53 hosted zone records"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_External_DNS_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "route53:ChangeResourceRecordSets"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:route53:::hostedzone/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "route53:ListResourceRecordSets",
                          + "route53:ListHostedZones",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.external_dns_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-dns-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.external_dns_irsa.aws_iam_role_policy_attachment.external_dns[0] will be created
  + resource "aws_iam_role_policy_attachment" "external_dns" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-dns-dev"
    }

  # module.external_secrets_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:external-secrets:external-secrets",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.external_secrets_irsa.aws_iam_policy.external_secrets[0] will be created
  + resource "aws_iam_policy" "external_secrets" {
      + arn         = (known after apply)
      + description = "Provides permissions to for External Secrets to retrieve secrets from AWS SSM and AWS Secrets Manager"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_External_Secrets_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:DescribeParameters"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:ListSecrets"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:*:key/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.external_secrets_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-secrets-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.external_secrets_irsa.aws_iam_role_policy_attachment.external_secrets[0] will be created
  + resource "aws_iam_role_policy_attachment" "external_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-secrets-dev"
    }

  # module.load_balancer_controller_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.load_balancer_controller_irsa.aws_iam_policy.load_balancer_controller[0] will be created
  + resource "aws_iam_policy" "load_balancer_controller" {
      + arn         = (known after apply)
      + description = "Provides permissions for AWS Load Balancer Controller addon"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_AWS_Load_Balancer_Controller-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:GetWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "wafv2:AssociateWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "waf-regional:AssociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:DeleteProtection",
                          + "shield:CreateProtection",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteTags",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DeleteRule",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "elasticloadbalancing:AddTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      + Sid       = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.load_balancer_controller_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-load-balancer-controller-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.load_balancer_controller_irsa.aws_iam_role_policy_attachment.load_balancer_controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "load_balancer_controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "aws-load-balancer-controller-dev"
    }

  # module.node_termination_handler_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node-termination-handler",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.node_termination_handler_irsa.aws_iam_policy.node_termination_handler[0] will be created
  + resource "aws_iam_policy" "node_termination_handler" {
      + arn         = (known after apply)
      + description = "Provides permissions to handle node termination events via the Node Termination Handler"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_Node_Termination_Handler_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:CompleteLifecycleAction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.node_termination_handler_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "node-termination-handler-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.node_termination_handler_irsa.aws_iam_role_policy_attachment.node_termination_handler[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_termination_handler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "node-termination-handler-dev"
    }

  # module.vpc_cni_irsa.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.vpc_cni_irsa.aws_iam_policy.vpc_cni[0] will be created
  + resource "aws_iam_policy" "vpc_cni" {
      + arn         = (known after apply)
      + description = "Provides the Amazon VPC CNI Plugin (amazon-vpc-cni-k8s) the permissions it requires to modify the IPv4/IPv6 address configuration on your EKS worker nodes"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "AmazonEKS_CNI_Policy-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:AssignIpv6Addresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "IPV6"
                    },
                  + {
                      + Action   = "ec2:CreateTags"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:*:*:network-interface/*"
                      + Sid      = "CreateTags"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "App" = "platform-eks-dev"
        }
      + tags_all    = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

  # module.vpc_cni_irsa.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "VPC-CNI-IRSA"
      + path                  = "/"
      + tags                  = {
          + "App" = "platform-eks-dev"
        }
      + tags_all              = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.vpc_cni_irsa.aws_iam_role_policy_attachment.vpc_cni[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_cni" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "platform-eks-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
          + "t3.medium",
          + "t3.xlarge",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "default-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "null",
        ]
      + tags                   = {
          + "App"                                        = "platform-eks-dev"
          + "Name"                                       = "default"
          + "k8s.io/cluster-autoscaler/enabled"          = "true"
          + "k8s.io/cluster-autoscaler/platform-eks-dev" = "owned"
        }
      + tags_all               = {
          + "App"                                        = "platform-eks-dev"
          + "Env"                                        = "dev"
          + "ManagedBy"                                  = "Terraform"
          + "Name"                                       = "default"
          + "OrchestratedBy"                             = "Terramate"
          + "Stack"                                      = "platform-k8s"
          + "StackPath"                                  = "/stacks/platform/platform-k8s"
          + "k8s.io/cluster-autoscaler/enabled"          = "true"
          + "k8s.io/cluster-autoscaler/platform-eks-dev" = "owned"
        }
      + version                = "1.25"

      + scaling_config {
          + desired_size = 3
          + max_size     = 20
          + min_size     = 3
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "default-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "App"                                        = "platform-eks-dev"
          + "k8s.io/cluster-autoscaler/enabled"          = "true"
          + "k8s.io/cluster-autoscaler/platform-eks-dev" = "owned"
        }
      + tags_all              = {
          + "App"                                        = "platform-eks-dev"
          + "Env"                                        = "dev"
          + "ManagedBy"                                  = "Terraform"
          + "OrchestratedBy"                             = "Terramate"
          + "Stack"                                      = "platform-k8s"
          + "StackPath"                                  = "/stacks/platform/platform-k8s"
          + "k8s.io/cluster-autoscaler/enabled"          = "true"
          + "k8s.io/cluster-autoscaler/platform-eks-dev" = "owned"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:List*",
              + "kms:Put*",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::023093918714:user/terraform-aws",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/platform-eks-dev"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "platform-eks-dev cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "App" = "platform-eks-dev"
        }
      + tags_all                           = {
          + "App"            = "platform-eks-dev"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "platform-k8s"
          + "StackPath"      = "/stacks/platform/platform-k8s"
        }
    }

Plan: 67 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + current_identity_account_id = (sensitive value)
  + current_identity_arn        = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
"

```

</details>

*Pusher: @kaio6fellipe, Action: `pull_request`, Workflow: `Terraform plan`*